{
  "description": "Mine tanker og observationer om alt og igenting",
  "index": {
    "title": "Blog"
  },
  "sidebar": {
    "heading": "Indlæg"
  },
  "posts": {
    "trongate": {
      "summary": "Trongate bliver ofte misforstået og får et dårligt ry, fordi det bryder med de gængse standarder og tager en rejse tilbage til rødderne. <br /> I dette indslag vil jeg udforske og fremhæve denne uslebne diamant, der fortjener en plads i rampelyset.",
      "intro": "Et spændende PHP framework, der udfordrer de etablerede standarder og tilbyder en enkel, men effektiv tilgang til udvikling.",
      "tagline": "Jeg har arbejdet med PHP i {{phpExpYears}} år og en ting der går igen, er <underline>unødvendig</underline> kode som skal vedligeholdes. <br /> Occam's razor kan nemt ses, når man aller helst vil rive <underline>alt</underline> op med roden og starte forfra, i håb om at bygge noget mere enkelt.",
      "mhavc": "Det er her hvor Trongate skinner, du får et enkelt starts  punkt med en solid starts arkitektur i kraft af at alt er indelt i moduler, inkl. media og JavaScript filer.",
      "missing_i18n": "En kritik der kunne gives, er at internationalisering (i18n) ikke er tænkt på og der faktisk ikke er nogen videre support for sprog. <br /> Det er korrekt og noget jeg <pr-link>tidligere</pr-link> har taklet, det er i planerne og jeg glæder mig til at se hvordan det løses. :)",
      "callback_validation": "En anden feature som tit flyver under radaren, er callback baseret validering",
      "hope": "Mit håb med denne artikel, er at vække folks interesse og fremhæve en usleben diamant som desværre har fået lidt et dårligt ry.",
      "before_i_go": "Før jeg går, vil jeg lige udpege",
      "mx": "Et bibliotek baseret på <htmx-link>HTMX</htmx-link> og meget hen af vejen har de samme features, bare mx- istedet for hx-",
      "mx_more": "Og dog tilbyder så meget mere, i form af en tæt integration, indbygget modal support, <mx-during-request>\"optimistisk\" UI</mx-during-request> og <mx-after-swap>mere.</mx-after-swap>",
      "mx-transition": {
        "intro": "mx-transition giver en nem og intuitiv måde at tilføje animationer til elementer og hele siden",
        "about_view_transitions": "View transitions er en <chrome-dev-article>relativt ny browserfunktion</chrome-dev-article>, den tilbyder flydende og granulære skfit mellem elementer og sider gennem CSS animationer"
      }
    }
  },
  "blog": {
    "recent": "De seneste indslag"
  }
}
